In [3]:
import pandas as pd
import numpy as np

# HOW TO CREATE A SERIES

In [ ]:
data = pd.Series(['kal', 20], index=['name', 'age'])
data

# HOW TO CREATE A DATAFRAME

In [4]:
df = pd.DataFrame({
    'name': ['kal', 'liam', 'jorel', 'mama', 'dada'],
    'age': [20, 13, 24, 47, 51],
    'gender': ['female', 'male', 'male', 'female', 'male'],
    'status': ['married', '', 'single', 'married', 'married']
})
print(df)

    name  age  gender   status
0    kal   20  female  married
1   liam   13    male
2  jorel   24    male   single
3   mama   47  female  married
4   dada   51    male  married

# WHAT IS A DATASET?
## - it is a structured collection of data

# HOW TO DROP A COLUMN

In [5]:
df.drop(columns=['status'], inplace=True)

In [6]:
df

    name  age  gender
0    kal   20  female
1   liam   13    male
2  jorel   24    male
3   mama   47  female
4   dada   51    male

# HOW TO COUNT UNIQUE VALUES IN SPECIFIC COLUMN e. 'gender'

In [7]:
df['gender'].value_counts()

gender
male      3
female    2
Name: count, dtype: int64

# CONDITION TO ONLY PRINT PEOPLE WITH AGE 40 AND ABOVE

In [8]:
df[df['age'] > 40]

   name  age  gender
3  mama   47  female
4  dada   51    male

# CONDITION TO ONLY PRINT FEMALES

In [10]:
df[df['gender'] == 'female']

   name  age  gender
0   kal   20  female
3  mama   47  female

# HOW TO CREATE A COLUMN WITH NAN VALUES

In [12]:
df['status'] = np.nan

In [13]:
df

    name  age  gender  status
0    kal   20  female     NaN
1   liam   13    male     NaN
2  jorel   24    male     NaN
3   mama   47  female     NaN
4   dada   51    male     NaN

# CODE TO PRINT THE NUMBER OF NP ARRAY IN DESCENDING ORDER

In [6]:
arr1 = np.array([4, 2, 1, 5, 3])
sorted = np.sort(arr1)[::-1]
print(sorted)

[5 4 3 2 1]